#menus generales que usare durante todo el codigo
administrar_coleccion = """
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠        Administrador de Colección          💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠      1️⃣  Añadir un Nuevo Elemento           💠
💠      2️⃣  Ver Todos los Elementos            💠
💠      3️⃣  Buscar un Elemento                 💠
💠      4️⃣  Editar un Elemento                 💠
💠      5️⃣  Eliminar un Elemento               💠
💠      6️⃣  Ver Elementos por Categoría        💠
💠      9️⃣  Salir                              💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
\nSelecciona una opción (1-6) o 9 para salir """
añadir_elemento = """
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠       Añadir un Nuevo Elemento                       💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠  ¿Qué tipo de elemento deseas añadir?                💠  
💠 📖     1️⃣  Libros                                  📖 💠
💠 🎬     2️⃣  Peliculas                               🎬 💠
💠 🎼     3️⃣  Musica                                  🎼 💠
💠        9️⃣  Regresar al Menú Principal                 💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
\nSelecciona una opción (1-3): o 9 para salir """
menu_ver_elementos = """"
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠          Ver Todos los Elementos           💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠 ¿Qué categoría deseas ver?                 💠
💠   1️⃣  Ver Todos los Libros                  💠
💠   2️⃣  Ver Todas las Películas               💠
💠   3️⃣  Ver Toda la Música                    💠
💠   9️⃣  Regresar al Menú Principal            💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
\nSelecciona una opción (1-3) o 9 para salir : """
menu_buscar_elemento = """
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠              Buscar un Elemento            💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠 ¿Cómo deseas buscar?                       💠
💠   1️⃣  Buscar por Título                     💠
💠   2️⃣  Buscar por Autor/Director/Artista     💠
💠   3️⃣  Buscar por Género                     💠
💠   9️⃣  Regresar al Menú Principal            💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
\nSelecciona una opción (1-3) o 9 para salir : """
menu_editar_elemento = """
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠           Editar un Elemento           💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠 ¿Qué tipo de cambio deseas realizar?   💠
💠     1️⃣  Editar Título                   💠
💠     2️⃣  Editar Autor/Director/Artista   💠
💠     3️⃣  Editar Género                   💠
💠     4️⃣  Editar Valoración               💠
💠     9️⃣  Regresar al Menú Principal      💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
\nSelecciona una opción (1-4) o 9 para salir : """
menu_elegir_tipo = """
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠              Categorias de elementos                 💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
💠 ¿De que categoria es el elemento que deseas eliminar?💠
💠 📖     1️⃣  Libros                                  📖 💠
💠 🎬     2️⃣  Peliculas                               🎬 💠
💠 🎼     3️⃣  Musica                                  🎼 💠
💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠💠
\nSelecciona una opcion (1-3) """
print(añadir_elemento)